Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: ?php cpdf_save( $pdf); / / do all kinds of rotations, transformations,... cpdf_restore($pdf)?
es: ?php cpdf_save( $pdf); / / hacer todo tipo de rotaciones, transformaciones,... cpdf_restore($pdf)?

source: See also cpdf_save().
es: Vea también cpdf_save().

source: The cpdf_rlineto() function draws a line from the current point to the relative point with coordinates (x-coor, y-coor).
es: La función cpdf_rlineto() dibuja una línea desde el punto actual al punto relativo con coordenadas (x-koor, y-koor).

source: The cpdf_rmoveto() function set the current point relative to the coordinates x-coor and y-coor.
es: La función cpdf_rmoveto() pone el punto actual relativo a las coordenadas x-koor y y-koor.

source: See also cpdf_moveto().
es: Vea también cpdf_moveto().

source: The cpdf_rotate() function set the rotation in degrees to angle.
es: La función cpdf_rotate() define la rotación en angle grados.

source: The cpdf_save() function saves the current environment.
es: La función cpdf_save() salva el entorno actual.

source: It works like the postscript command gsave.
es: Funciona como el comando gsave de postscript.

source: See also cpdf_restore().
es: Vea también cpdf_restore().

source: The cpdf_save_to_file() function outputs the pdf document into a file if it has been created in memory.
es: La función cpdf_save_to_file() La función cpdf_save_to_file() guarda el documento PDF en un fichero si este documeto ha sido creado en memoria.

source: This function is not needed if the pdf document has been open by specifying a filename as a parameter of cpdf_open().
es: Esta función no es necesaria si el documento PDF ha sido abierto mediante la especificación de un nombre de fichero en la función cpdf_open().

source: See also cpdf_output_buffer(), cpdf_open().
es: Vea también cpdf_output_buffer(), cpdf_open().

source: The cpdf_scale() function set the scaling factor in both directions.
es: La función cpdf_scale() define el factor de escala en los dos sentidos.

source: The cpdf_set_char_spacing() function sets the spacing between characters.
es: LA función cpdf_set_char_spacing() define el espacio entre caracteres.

source: See also cpdf_set_word_spacing(), cpdf_set_leading().
es: Vea también cpdf_set_word_spacing(), cpdf_set_leading().

source: The cpdf_set_creator() function sets the creator of a pdf document.
es: La función cpdf_set_creator() define el creador de un documento PDF.

source: See also cpdf_set_subject(), cpdf_set_title(), cpdf_set_keywords().
es: Vea también cpdf_set_subject(), cpdf_set_title(), cpdf_set_keywords().

source: The cpdf_set_current_page() function set the page on which all operations are performed.
es: La función cpdf_set_current_page() define la página en la que se van a realizar todas las operaciones.

source: One can switch between pages until a page is finished with cpdf_finalize_page().
es: Uno puede cambiar entre páginas a menos que una página ha sido finalizada con cpdf_finalize_page().

source: See also cpdf_finalize_page().
es: Vea también cpdf_finalize_page().

source: The cpdf_setdash() function set the dash pattern white white units and black black units.
es: La función cpdf_setdash() define el patrón de la raya white unidades blancas y black La función cpdf_setdash() define el patrón de la raya white unidades blancas y black unidades negras.

source: If both are 0 a solid line is set.
es: Si los dos son 0 se pone una línea sólida.

source: The cpdf_setflat() function set the flatness to a value between 0 and 100.
es: La función cpdf_setflat() pone la monotonía a un valor de entre 0 y 100.

source: The cpdf_set_font() function sets the current font face, font size and encoding.
es: La función cpdf_set_font() define la fuente actual, el tamaño y la codificación.

source: Currently only the standard postscript fonts are supported.
es: Actualmente solo son soportadas las fuentes estándar de postscript.

source: The last parameter encoding can take the following values: "MacRomanEncoding", "MacExpertEncoding", "WinAnsiEncoding", and" NULL "." NULL "stands for the font's built-in encoding.
es: El último parámetro encoding puede tomar los siguientes valores: "MacRomanEncoding", "MacExpertEncoding", "WinAnsiEncoding", y" NULL "." NULL "es para el cifrado incluído en la fuente.

source: See the ClibPDF Manual for more information, especially how to support asian fonts.
es: Para mas información vea el manual de ClibPDF, especialmente para cómo soportar las fuentes asiáticas.

source: The cpdf_setgray_fill() function sets the current gray value to fill a path.
es: La función cpdf_setgray_fill() define el valor de gris actual para rellelanr un camino.

source: See also cpdf_setrgbcolor_fill().
es: Vea también cpdf_setrgbcolor_fill().

source: The cpdf_setgray() function sets the current drawing and filling color to the given gray value.
es: La función cpdf_setgray_stroke() pone el color de relleno y dibujo al color gris dado.

source: See also cpdf_setrgbcolor_stroke(), cpdf_setrgbcolor_fill().
es: Vea también cpdf_setrgbcolor_stroke(), cpdf_setrgbcolor_fill().

source: The cpdf_setgray_stroke() function sets the current drawing color to the given gray value.
es: La función cpdf_setgray_stroke() pone el color de dibujo actual al valor de gris dado.

source: See also cpdf_setrgbcolor_stroke().
es: Vea también cpdf_setrgbcolor_stroke().

source: The cpdf_set_horiz_scaling() function sets the horizontal scaling to scale percent.
es: La función cpdf_set_horiz_scaling() define la escala horizontal al scale por ciento.

source: The cpdf_set_keywords() function sets the keywords of a pdf document.
es: La función cpdf_set_keywords() define las palabras clave de un documento PDF.

source: See also cpdf_set_title(), cpdf_set_creator(), cpdf_set_subject().
es: Vea también cpdf_set_title(), cpdf_set_creator(), cpdf_set_subject().

source: The cpdf_set_leading() function sets the distance between text lines.
es: La función cpdf_set_leading() La función cpdf_set_leading() define la distancia entre las líneas de texto.

source: This will be used if text is output by cpdf_continue_text().
es: Esto se usará si el texto es la salida de cpdf_continue_text().

source: See also cpdf_continue_text().
es: Vea también cpdf_continue_text().

source: The cpdf_setlinecap() function set the linecap parameter between a value of 0 and 2.
es: La función cpdf_setlinecap() La función cpdf_setlinecap() define el parámetro linecap entre los valores 0 y 2.

source: 0 = butt end, 1 = round, 2 = projecting square.
es: 0 = empalmar al final, 1 = redondear, 2 = esquina proyectada

source: The cpdf_setlinejoin() function set the linejoin parameter between a value of 0 and 2.
es: La función cpdf_setlinejoin() La función cpdf_setlinejoin() define el parámetro entre un valor de 0 y 2.

source: 0 = miter, 1 = round, 2 = bevel.
es: 0 = ingletes, 1 = redondear, 2 = ángulo oblícuo

source: The cpdf_setlinewidth() function set the line width to width.
es: La función cpdf_setlinewidth() define la preofundidad de la línea a width.

source: The cpdf_setmiterlimit() function set the miter limit to a value greater or equal than 1.
es: La función cpdf_setmiterlimit() define el límite del inglete a un valor mayor o igual a 1.

source: The cpdf_set_page_animation() function set the transition between following pages.
es: La función cpdf_set_page_animation() define la transición entre páginas que se siguen.

source: The value of transition can be
es: El valor de transition puede ser

source: 0 for none,
es: 0 para ninguno,

source: 1 for two lines sweeping across the screen reveal the page,
es: 1 para dos líneas que se barren a través de la pantalla, revelen la página,

source: 2 for multiple lines sweeping across the screen reveal the page,
es: 2 para múltiples líneas,

source: 3 for a box reveals the page,
es: 3 para que una caja revele la página,

source: 4 for a single line sweeping across the screen reveals the page,
es: 4 para una única línea,

source: 5 for the old page dissolves to reveal the page,
es: 5 para que la página naterior se disipe para revelar la pagina,

source: 6 for the dissolve effect moves from one screen edge to another,
es: 6 para que el efecto de disolución se mueva de un extremop de la página al otro,

source: 7 for the old page is simply replaced by the new page (default)
es: 7 para que la página antígua simplemente sea reemplazada por la nueva página (default)

source: The value of duration is the number of seconds between page flipping.
es: El valor de duration es el número de segundos entre las páginas que se pasan.

source: The cpdf_setrgbcolor_fill() function sets the current rgb color value to fill a path.
es: La función cpdf_setrgbcolor_fill() pone el color rgb actual para rellenar un camino.

source: See also cpdf_setrgbcolor_stroke(), cpdf_setrgbcolor().
es: Vea también cpdf_setrgbcolor_stroke(), cpdf_setrgbcolor().

source: The cpdf_setrgbcolor() function sets the current drawing and filling color to the given rgb color value.
es: La función cpdf_setrgbcolor_stroke() pone el color de relleno y dibujo actual al color rgb dado.

source: The cpdf_setrgbcolor_stroke() function sets the current drawing color to the given rgb color value.
es: La función cpdf_setrgbcolor_stroke() pone el color de dibujo actual al valor de color rgb dado.

source: See also cpdf_setrgbcolor_fill(), cpdf_setrgbcolor().
es: Vea también cpdf_setrgbcolor_fill(), cpdf_setrgbcolor().

source: The cpdf_set_subject() function sets the subject of a pdf document.
es: La función cpdf_set_subject() define el asunto de un documento PDF

source: See also cpdf_set_title(), cpdf_set_creator(), cpdf_set_keywords().
es: Vea también cpdf_set_title(), cpdf_set_creator(), cpdf_set_keywords().

source: The cpdf_set_text_matrix() function sets a matrix which describes a transformation applied on the current text font.
es: La función cpdf_set_text_matrix() define una matriz que describe una transformación aplicada a la fuente actual de texto.

source: The cpdf_set_text_pos() function sets the position of text for the next cpdf_show() function call.
es: La función cpdf_set_text_pos() define la posición del texto para la siguiente llamada a cpdf_show().

source: See also cpdf_show(), cpdf_text().
es: Vea también cpdf_show(), cpdf_text().

source: The cpdf_set_text_rendering() function determines how text is rendered.
es: La función cpdf_set_text_rendering() determina cómo es presentado el texto.

source: The possible values for mode are 0=fill text, 1=stroke text, 2=fill and stroke text, 3=invisible, 4=fill text and add it to clipping path, 5=stroke text and add it to clipping path, 6=fill and stroke text and add it to clipping path, 7=add it to clipping path.
es: Los posibles valores para mode son 0=llenar texto, 1=poner texto, 2=llenar y poner texto, 3=invisible, 4=llenar texto y añadirlo al camino de corte, 5=poner texto y añadirlo al camino de corte, 6=llenar y poner texto y añadirlo al camino de corte, 7=añadirlo al camino de corte

source: The cpdf_set_text_rise() function sets the text rising to value units.
es: La función cpdf_set_text_rise() define la elevación del texto a value unidades.

source: The cpdf_set_title() function sets the title of a pdf document.
es: La función cpdf_set_title() define el título de un documento PDF

source: See also cpdf_set_subject(), cpdf_set_creator(), cpdf_set_keywords().
es: Vea también cpdf_set_subject(), cpdf_set_creator(), cpdf_set_keywords().

source: The cpdf_set_word_spacing() function sets the spacing between words.
es: La función cpdf_set_word_spacing() especifica el espacio entre palabras.

source: See also cpdf_set_char_spacing(), cpdf_set_leading().
es: Vea también cpdf_set_char_spacing(), cpdf_set_leading().

source: The cpdf_show() function outputs the string in text at the current position.
es: La función cpdf_show() muestra la cadena text en la posixción actual.

source: See also cpdf_text(), cpdf_begin_text(), cpdf_end_text().
es: Vea también cpdf_text(), cpdf_begin_text(), cpdf_end_text().

source: The cpdf_show_xy() function outputs the string text at position with coordinates (x-coor, y-coor).
es: La función cpdf_show_xy() muestra la cadena text en la posición con coordenadas (x-coor, y-coor).

source: The function cpdf_show_xy() is identical to cpdf_text() without the optional parameters.
es: La función cpdf_show_xy() es idéntica a cpdf_text() sin el parámetro opcional.

source: See also cpdf_text().
es: Vea también cpdf_text().

source: The cpdf_stringwidth() function returns the width of the string in text.
es: La función cpdf_stringwidth() devuelve la anchura de la cadena text.

source: It requires a font to be set before.
es: Requiere haber definido antes una fuente.

source: See also cpdf_set_font().
es: Vea también cpdf_set_font().

source: The cpdf_stroke() function draws a line along current path.
es: La función cpdf_stroke() dibuja una línea a lo largo del camino actual.

source: See also cpdf_closepath(), cpdf_closepath_stroke().
es: Vea también cpdf_closepath(), cpdf_closepath_stroke().

source: The cpdf_text() function outputs the string text at position with coordinates (x-coor, y-coor).
es: La función cpdf_text() muestra la cadena text en la posición de coordenadas (x-coor, y-coor).

source: The optional parameter orientation is the rotation of the text in degree.
es: El parámetro opcional orientation es la rotación del texto en grados.

source: The optional parameter alignmode determines how the text is aligned.
es: El parámetro opcional alignmode determina cómo está alineado el texto.

source: See the ClibPDF documentation for possible values.
es: Vea la documentación de ClibPDF para los posibles valores.

source: See also cpdf_show_xy().
es: Vea también cpdf_show_xy().

source: The cpdf_translate() function set the origin of coordinate system to the point (x-coor, y-coor).
es: La función cpdf_translate() define el sistema origen de coordenadas en el punto (x-coor, y-coor).

source: Example 1.
es: Se suele utilizar para validad la integridad de los datos transmitidos.

source: ?php $checksum = crc32( "The quick brown fox jumped over the lazy dog ."); printf("%u\n", $checksum);?
es: Vea también: md5()

source: crypt() will return an encrypted string using the standard Unix DES -based encryption algorithm or alternative algorithms that may be available on the system.
es: crypt() encriptará una cadena utilizando el método estándar de encriptación del Unix DES.

source: Arguments are a string to be encrypted and an optional salt string to base the encryption on.
es: Los argumentos son una cadena a encriptar y una cadena semilla de 2 caracteres en la que basar la encriptación.

source: See the Unix man page for your crypt function for more information.
es: Vea la página de manual de Unix sobre crypt para más información.

source: If the salt argument is not provided, one will be randomly generated by PHP.
es: Si el argumento de semilla no se proporciona, será generado aleatoriamente por el PHP.

source: Some operating systems support more than one type of encryption.
es: Algunos sistemas operativos soportan más de un tipo de encriptación.

source: The encryption type is triggered by the salt argument.
es: De hecho, algunas veces la encriptación estándar DES es sustituída por un algoritmo de encriptación basado en MD5.

source: At install time, PHP determines the capabilities of the crypt function and will accept salts for other encryption types.
es: El tipo de encriptación es disparado por el argumento semilla.

source: If no salt is provided, PHP will auto-generate a standard two character salt by default, unless the default encryption type on the system is MD5, in which case a random MD5-compatible salt is generated.
es: En tiempo de instalación, el PHP determina la capacidad de la función de encriptación y aceptará semillas para otros tipos de encriptación.

source: If you are using the supplied salt, you should be aware that the salt is generated once.
es: Si no se proporciona la semilla, el PHP intentará generar una semilla estándar DES de 2 caraceres por defecto, excepto si el tipo de encriptación estándar del sistema es el MD5, en cuyo caso se generará una semilla aleatoria compatible con MD5.

source: The standard DES-based encryption crypt() returns the salt as the first two characters of the output.
es: El PHP fija una constante llamada CRYPT_SALT_LENGTH que le especifica si su sistema soporta una semilla de 2 caracteres o si se debe usar la semilla de 12 caracteres del NDS.

source: It also only uses the first eight characters of str, so longer strings that start with the same eight characters will generate the same result (when the same salt is used).
es: La función estándar de encriptación crypt() contiene la semilla como los dos primeros caracteres de la salida.

source: On systems where the crypt() function supports multiple encryption types, the following constants are set to 0 or 1 depending on whether the given type is available:
es: En los sistemas en los que la función crypt() soporta múltiples tipos de encriptación, las siguienes constantes son fijadas a 0 ó 1 dependiendo de si está disponible el tipo dado:

source: CRYPT_STD_DES - Standard DES-based encryption with a two character salt
es: CRYPT_STD_DES - Encriptación DES estándar con semilla de 2 caracteres

source: CRYPT_EXT_DES - Extended DES-based encryption with a nine character salt
es: CRYPT_EXT_DES - Encriptación DES extendida con semilla de 9 caracteres

source: CRYPT_MD5 - MD5 encryption with a twelve character salt starting with $1$
es: CRYPT_MD5 - Encriptación MD5 con semilla de 12 caracteres y comenzando por $1$

source: Example 1. crypt() examples
es: No hay función de desencriptado porque crypt() utiliza un algoritmo de una sola vía.

source: See also md5() and the Mcrypt extension.
es: Vea también: md5().

source: Database (dbm-style) abstraction layer functions
es: Funciones de la capa de abstraccion de bases de datos (dbm-style)

source: This function closes a CURL session and frees all resources.
es: This functions closes a CURL session and frees all ressources.

source: Its purpose is simply to execute the predefined CURL session (given by the ch).
es: This function is should be called after you initialize a CURL session and all the options for the session are set.

source: ?php $ch = curl_init(); curl_setopt ($ch, CURLOPT_URL, "http: / /www.example.com / "); curl_setopt ($ch, CURLOPT_HEADER, 0); curl_exec ($ch); curl_close ($ch);?
es: ?php $ch = curl_init(); curl_setopt ($ch, CURLOPT_URL, "http: / /www.zend.com / "); curl_setopt ($ch, CURLOPT_HEADER, 0); curl_exec ($ch); curl_close ($ch);?

source: The default behavior is to return the page normally, ignoring the code.
es: The default behaviour is to return the page normally, ignoring the code.

source: This POST is a normal application / x-www-form-urlencoded kind, most commonly used by HTML forms.
es: This POST is a normal application / x-www-from-urlencoded kind, most commonly used by HTML forms.

source: Set this option to a non-zero value to HTTP PUT a file.
es: Set this option a non-zero value to HTTP PUT a file.

source: It should be in the "X-Y" format, where X or Y may be left out.
es: Pass a string formatted in the [username] :[password] manner, for PHP to use for the connection. connection.

source: Pass a string containing the value which will be used to get the IP address to use for the ftp "POST" instruction.
es: The HTTP transfers also support several intervals, seperated with commas as in X-Y,N-M.

source: The cookie file can be in Netscape format, or just plain HTTP-style headers dumped into a file.
es: Pass a string containing the which will be used to get the IP address to use for the ftp "PORT" instruction.

source: Anyone of the following strings (in order from least powerful, to most powerful): 'clear', 'safe', 'confidential', 'private '.
es: Pass a string containing the name of the file containing the cookiee data.

source: Pass an array of FTP commands to perform on the server prior to the FTP request.
es: This is useful for doing DELETE or another, more obscure, HTTP request.

source: CURLOPT_POSTQUOTE:
es: Nota:

source: Cybercash payment functions
es: Funciones de pago electrónico

source: Every array has an internal pointer to its "current" element, which is initialized to the first element inserted into the array.
es: Cada matriz tiene un puntero interno al elemento "actual", que se inicializa al primer elemento insertado en la misma.

source: The current() function simply returns the array element that's currently being pointed by the internal pointer.
es: La función current() simplemente devuelve el elemento de la tabla al que apunta el puntero interno.

source: It does not move the pointer in any way.
es: No mueve el puntero de ninguna manera.

source: If the internal pointer points beyond the end of the elements list, current() returns FALSE.
es: Si el puntero interno apunta fuera del final de la lista de elementos, current() devuelve FALSE.

source: If the array contains empty elements (0 or "", the empty string) then this function will return FALSE for these elements as well.
es: Si la matriz contiene elementos vacíos (0 ó "", la cadena vacía) esta función devolverá FALSE también para dichos elementos.

source: This makes it impossible to determine if you are really at the end of the list in such an array using current().
es: Esto hace imposible determinar si se está realmente al final de la lista en tales matrices usando current().

source: To properly traverse an array that may contain empty elements, use the each() function.
es: Para recorrer adecuadamente una matriz que pueda contener elementos vacíos, utilice la función each().

source: The function returns an associative array with the elements "errcode" and, if "errcode "is FALSE, "outbuff" (string), "outLth "(long) and "macbuff" (string).
es: La función devuelve un array asociativo con los elementos "errcode" y, si "errcode "es FALSE, "outbuff" (string), "outLth "(long) y "macbuff" (string).

source: On windows this range is limited from 01-01-1970 to 19-01-2038.
es: Devuelve una cadena formateada de acuerdo con la cadena de formato dada, utilizando el valor de timestamp dado o la hora local actual si no hay parámetro.

source: Additionally, some databases have functions to convert their date formats into timestamps (such as MySQL's UNIX_TIMESTAMP function).
es: Se reconocen los siguientes caracteres en la cadena de formato:

source: format character
es: a - "am" o "pm "

source: 01 to 31
es: A - "AM" o "PM "

source: Mon through Sun
es: d - día del mes, dos dígitos con cero a la izquierda; es decir, de "01 "a "31"

source: January through December
es: D - día de la semana, en texto, con tres letras; por ejemplo, "Fri "

source: 1 through 12
es: F - mes, en texto, completo; por ejemplo, "January "

source: 0 through 23
es: h - hora, de "01" a "12 "

source: 01 through 12
es: H - hora, de "00" a "23 "

source: 00 through 23
es: g - hour, sin ceros, de "1" a "12 "

source: 1 if Daylight Savings Time, 0 otherwise.
es: G - hour, sin ceros; de "0 "a "23"

source: Sunday through Saturday
es: i - minutos; de "00 "a "59"

source: 1 if it is a leap year, 0 otherwise.
es: j - día del mes sin cero inicial; de "1 "a "31"

source: Jan through Dec
es: L - "1" or "0 ", según si el año es bisiesto o no

source: Example: +0200
es: n - mes sin cero inicial; de "1 "a "12"

source: st, nd, rd or th.
es: M - mes, en texto, 3 letras; por ejemplo, "Jan "

source: See also time()
es: s - segundos; de "00 "a "59"

source: 0 (for Sunday) through 6 (for Saturday)
es: S - sufijo ordinal en inglés, en texto, 2 caracteres; por ejemplo, "th", "nd "

source: Example:
es: t - número de días del mes dado; de "28 "a "31"

source: Examples:
es: U - segundos desde el valor de 'epoch'
